# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\rdn\Documents\PSoC Creator\SEES\ble_test.cydsn\ble_test.cyprj
# Date: Sat, 01 Jun 2024 21:14:08 GMT
#set_units -time ns
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyClk_LF} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyPLL0} -period 6.666666666666667 -waveform {0 3.33333333333333} [list [get_pins {ClockBlock/pll_0}]]
create_clock -name {CyClk_HF0} -period 6.666666666666667 -waveform {0 3.33333333333333} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 6.666666666666667 -waveform {0 3.33333333333333} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 13.333333333333334 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {UART_DEBUG_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 55 109} -nominal_period 720 [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {CyPeriClk_App} -period 13.333333333333334 -waveform {0 6.66666666666667} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyFLL} -period 20.345052083333332 -waveform {0 10.1725260416667} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyClk_HF1} -period 20.345052083333332 -waveform {0 10.1725260416667} [list [get_pins {ClockBlock/hfclk_1}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Users\rdn\Documents\PSoC Creator\SEES\ble_test.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\rdn\Documents\PSoC Creator\SEES\ble_test.cydsn\ble_test.cyprj
# Date: Sat, 01 Jun 2024 21:13:48 GMT
